Revit 2027 API
UnitTypeId.SquareFeet Property
 Square feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SquareFeet { get; }
Public Shared ReadOnly Property SquareFeet As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SquareFeet {
	ForgeTypeId^ get ();
}
static member SquareFeet : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace